app/views/shelters/index.html.erb

      <div id="adjustments">
      <% if Shelter.find_shelters_with_pets_under_adoption(shelter) %>
---
SELECT "pets".* FROM "pets" WHERE "pets"."shelter_id" = $1  [["shelter_id", 11]]