app/views/shelters/show.html.erb

<div id="review_section">
  <% @shelter.reviews.each do |review| %>
---
SELECT "reviews".* FROM "reviews" WHERE "reviews"."shelter_id" = $1  [["shelter_id", 1]]