app/views/applications/show.html.erb

<h3>Pets applied for:</h3>
<% @app.pets.each do |pet| %>
---
SELECT "pets".* FROM "pets" INNER JOIN "application_pets" ON "pets"."id" = "application_pets"."pet_id" WHERE "application_pets"."application_id" = $1  [["application_id", 3]]