app/controllers/applications_controller.rb

  def create
    app = Application.new(app_params)
    if app.save
---
INSERT INTO "applications" ("name", "address", "city", "state", "zip", "phone", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"

  def show
    @app = Application.find(params[:id])
---
SELECT  "applications".* FROM "applications" WHERE "applications"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]

  def pet_apps
    @pet = Pet.find(params[:id])
    @applicants = Application.select(:name, :id).joins(:pets).where("pets.id = #{@pet.id}")
---
SELECT  "pets".* FROM "pets" WHERE "pets"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]
SELECT  "applications"."name", "applications"."id" FROM "applications" INNER JOIN "application_pets" ON "application_pets"."application_id" = "applications"."id" INNER JOIN "pets" ON "pets"."id" = "application_pets"."pet_id" WHERE (pets.id = 10) ORDER BY "applications"."id" ASC LIMIT $1  [["LIMIT", 1]]