app/controllers/application_pets_controller.rb

SELECT  "pets".* FROM "pets" WHERE "pets"."id" = $1 LIMIT $2  [["id", 34], ["LIMIT", 1]]
SELECT "application_pets".* FROM "application_pets" WHERE (pet_id = 2 AND application_id = 1-application_pets)
UPDATE "application_pets" SET "status" = $1, "updated_at" = $2 WHERE "application_pets"."id" = $3  [["status", "Approved"], ["updated_at", "2019-12-10 02:28:59.011791"], ["id", 13]]
UPDATE "pets" SET "adoption_status" = $1, "updated_at" = $2 WHERE "pets"."id" = $3  [["adoption_status", "Pending Adoption"], ["updated_at", "2019-12-10 02:28:59.016378"], ["id", 34]]
---
  def update
    if params[:status] == "false"
      app_pet_id = ApplicationPet.where("pet_id = #{params[:pet_id]} AND application_id = #{params[:app_id]}").pending_status
      app_pet_id.first.save