app/controllers/applications_controller.rb

SELECT  "pets".* FROM "pets" WHERE "pets"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
  def create
    app = Application.new(app_params)
    if app.save
      pets = params[:favorite_ids].map { |id| Pet.find(id) }