app/controllers/favorites_controller.rb

  def index
    @app_pets = Favorite.find_pending_adoption_pets
    pet_ids = @favorites.contents.keys
    @pets = pet_ids.reduce([]) do |acc, key|
      acc << Pet.find(key.to_i)
---
SELECT  "pets".* FROM "pets" WHERE "pets"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def update
    pet = Pet.find(params[:id])
---
SELECT  "pets".* FROM "pets" WHERE "pets"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]

  def destroy
    pet = Pet.find(params[:id])
---
SELECT  "pets".* FROM "pets" WHERE "pets"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]