app/controllers/pets_controller.rb

  def index
    if params[:adoptable] == "true"
      @pets = Pet.where(adoption_status: 'Adoptable')
    elsif params[:adoptable] == "false"
      @pets = Pet.where(adoption_status: 'Pending Adoption')
    else
      @pets = Pet.order(:adoption_status)
---
SELECT "pets".* FROM "pets" WHERE "pets"."adoption_status" = $1  [["adoption_status", "adoptable"]]
SELECT "pets".* FROM "pets" ORDER BY "pets"."adoption_status" ASC

  def new
    @shelter = Shelter.find(params[:shelter_id])
---
SELECT  "shelters".* FROM "shelters" WHERE "shelters"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def create
    @shelter = Shelter.find(params[:shelter_id])
    pet = @shelter.pets.create(pet_params)
---
SELECT  "shelters".* FROM "shelters" WHERE "shelters"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
INSERT INTO "pets" ("image", "name", "approximate_age", "sex", "shelter_id", "description") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["image", "<199 bytes of binary data>"], ["name", "Berkley"], ["approximate_age", 2], ["sex", "Male"], ["shelter_id", 2], ["description", "Fluffy golden"]]

  def show
    @shelter = Shelter.find(params[:shelter_id])
    if params[:adoptable] == "true"
      @pets = @shelter.pets.where(adoption_status: 'Adoptable')
---
SELECT  "shelters".* FROM "shelters" WHERE "shelters"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "pets".* FROM "pets" WHERE "pets"."shelter_id" = $1 ORDER BY "pets"."adoption_status" ASC  [["shelter_id", 1]]

  def show_pet
    @pet = Pet.find(params[:id])
    #ApplicationPet.select(:application_id).where("pet_id = #{@pet.id} AND status = 'Adoption Pending'")
    open_apps = @pet.application_pets
    app_ids = open_apps.map do |app|
---
SELECT  "pets".* FROM "pets" WHERE "pets"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "application_pets".* FROM "application_pets" WHERE "application_pets"."pet_id" = $1  [["pet_id", 1]]

  def edit
    @pet = Pet.find(params[:id])
---
SELECT  "pets".* FROM "pets" WHERE "pets"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]

  def update
    pet = Pet.find(params[:id])
    pet.update(pet_params)
---
SELECT  "pets".* FROM "pets" WHERE "pets"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
UPDATE "pets" SET "name" = $1, "image" = $2, "description" = $3, "sex" = $4, "approximate_age" = $5 WHERE "pets"."id" = $6  [["name", "Berkley"], ["image", "<199 bytes of binary data>"], ["description", "Fluffy golden big time"], ["sex", "Female"], ["approximate_age", 3], ["id", 101]]

  def destroy
    pet = Pet.find(params[:id])
    if Pet.find_pets_with_approved_application(pet)
      Pet.destroy(params[:id])
---
SELECT  "pets".* FROM "pets" WHERE "pets"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
DELETE FROM "pets" WHERE "pets"."id" = $1  [["id", 3]]

  def change_adoption_status
    pet = Pet.find(params[:id])
      if pet.adoption_status == "Adoptable"
        status = "Pending Adoption"
      else
        status = "Adoptable"
      end
    pet.update({adoption_status: status})
---
SELECT  "pets".* FROM "pets" WHERE "pets"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
UPDATE "pets" SET "adoption_status" = $1, "updated_at" = $2 WHERE "pets"."id" = $3  [["adoption_status", "adoption-pending"], ["updated_at", "2019-12-03 21:13:31.173133"], ["id", 1]]