app/controllers/pets_controller.rb

  def index
    pets = Pet.all
---
SELECT "pets".* FROM "pets"