app/controllers/reviews_controller.rb

  def new
    @shelter = Shelter.find(params[:shelter_id])
---
SELECT  "shelters".* FROM "shelters" WHERE "shelters"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def create
    @shelter = Shelter.find(params[:shelter_id])
    review = @shelter.reviews.new(review_params)

    if review.save
---
SELECT  "shelters".* FROM "shelters" WHERE "shelters"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "reviews" ("title", "rating", "content", "shelter_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "Wonderful"], ["rating", 3], ["content", "Nasty!"], ["shelter_id", 1], ["created_at", "2019-12-04 01:41:43.250599"], ["updated_at", "2019-12-04 01:41:43.250599"]]

  def edit
    @shelter = Shelter.find(params[:shelter_id])
    @review = @shelter.reviews.find(params[:review_id])
---
SELECT  "reviews".* FROM "reviews" WHERE "reviews"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]