app/controllers/shelters_controller.rb

SELECT "reviews".* FROM "reviews" WHERE "reviews"."shelter_id" = $1  [["shelter_id", 1]]
---
  def show
    @shelter = Shelter.find(params[:id])
    #require "pry"; binding.pry
    @reviews = Review.where(shelter_id: params[:id])