app/controllers/shelters_controller.rb

  def index
    shelters = Shelter.all
    if params[:sorted] == "false"
      shelters
    elsif params[:sorted] == "true"
      shelters = shelters.sort_by do |shelter|
        shelter.pets.count
---
SELECT "shelters".* FROM "shelters"
SELECT COUNT(*) FROM "pets" WHERE "pets"."shelter_id" = $1  [["shelter_id", 1]]

  def show
    @shelter = Shelter.find(params[:id])
---
SELECT  "shelters".* FROM "shelters" WHERE "shelters"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def create
    shelter = Shelter.create(shelter_params)
---
INSERT INTO "shelters" ("name", "address", "city", "state", "zip", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["name", "Harrison "], ["address", "123 Lane"], ["city", "Denver"], ["state", "Co"], ["zip", 80123], ["created_at", "2019-12-11 18:58:20.256397"], ["updated_at", "2019-12-11 18:58:20.256397"]]

  def edit
    @shelter = Shelter.find(params[:id])
---
SELECT  "shelters".* FROM "shelters" WHERE "shelters"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]

  def update
    shelter = Shelter.find(params[:id])
    shelter.update(shelter_params)
---
SELECT  "shelters".* FROM "shelters" WHERE "shelters"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
UPDATE "shelters" SET "name" = $1, "zip" = $2, "updated_at" = $3 WHERE "shelters"."id" = $4  [["name", "Updated Shelter Name"], ["zip", 80123], ["updated_at", "2019-12-03 02:46:07.869949"], ["id", 30]]

  def destroy
    shelter = Shelter.find(params[:id])
    if Shelter.find_shelters_with_pets_under_adoption(shelter)
      Shelter.destroy(params[:id])
---
SELECT  "shelters".* FROM "shelters" WHERE "shelters"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT "pets".* FROM "pets" WHERE "pets"."shelter_id" = $1  [["shelter_id", 11]]
DELETE FROM "shelters" WHERE "shelters"."id" = $1  [["id", 2]]